//
//    (C) 2005,2014 Aktiv Co. All rights reserved.
//    Definitions for Guardant API libraries.
//

#ifndef __GRDAPI__H_
#define __GRDAPI__H_

#if defined(_WIN32_WCE)
#define GRD_API             __cdecl
#elif defined(__WIN32__) || defined(_WIN32) || defined(WIN32) || defined(_WIN64)
#define GRD_API             __stdcall
#elif defined(__GNUC__)
#define GRD_API
#else
#error "This Guardant API supports 32/x64-bit compilers only"
#endif

#if (defined(__WIN32__) || defined(_WIN32) || defined(WIN32) || defined(_WIN64)) && !defined (__GNUC__)
typedef int BOOL;
typedef unsigned char BYTE;
typedef unsigned short WORD;
typedef unsigned long DWORD;
typedef unsigned __int64 QWORD;
typedef void* HANDLE;
#else
#ifdef __cplusplus
// for future use
// #include <cstdint>
// #include <tr1/cstdint>
#include <stdint.h>
#else // __cplusplus
#include <stdint.h>
#endif // __cplusplus
typedef int32_t BOOL;
typedef uint8_t BYTE;
typedef uint16_t WORD;
typedef uint32_t DWORD;
typedef uint64_t QWORD;
typedef void* HANDLE;
#endif

#define GrdContainerSize    0x4000  // Size of memory allocated for Guardant protected container

//- Demo Codes
#define GrdDC_DEMONVK       0x519175b7Lu  // Demo public code
#define GrdDC_DEMORDO       0x51917645Lu  // Demo private read code
#define GrdDC_DEMOPRF       0x51917603Lu  // Demo private write code
#define GrdDC_DEMOMST       0x5191758cLu  // Demo private master code

//- Dongle Models

#define GrdE_NeedInitialization     71  // Initialization is required
#define GrdE_gcProhibitCode         72  // Verification of loadable code failed
// Probable reasons: invalid entry point, forbidden instructions
// in the code, attempt to access prohibited memory address
#define GrdE_gcLoadableCodeTimeOut  73                 // Loadable code time out
#define GrdE_gcFlashSizeFromDescriptorTooSmall      74 // Flash memory size specified in item descriptor for loadable code is too small
#define GrdE_Reserved75                             75 // Reserved
#define GrdE_Reserved76                             76 // Reserved
#define GrdE_Reserved77                             77 // Reserved
#define GrdE_Reserved78                             78 // Reserved
#define GrdE_Reserved79                             79 // Reserved
#define GrdE_gcIncorrectMask                        80 // TGrdLoadableCodeData structure exceeds space reserved for determinant in item descriptor
#define GrdE_gcRamOverboundInProtect                81 // Incorrect RAM area specified in loadable code descriptor
#define GrdE_gcFlashOverboundInProtect              82 // Incorrect FLASH memory area specified in loadable code descriptor
#define GrdE_gcIntersectionOfCodeAreasInProtect     83 // Allocation of intersecting FLASH memory areas for different loadable code modules
#define GrdE_gcBmapFileTooBig                       84 // BMAP file is too long
#define GrdE_gcZeroLengthProgram                    85 // The loadable code has zero length
#define GrdE_gcDataCorrupt                          86 // Data verification failed
#define GrdE_gcProtocolError                        87 // Error in Guardant Code protocol
#define GrdE_gcGCEXENotFound                        88 // Loadable code not found
#define GrdE_gcNotEnoughRAM                         89 // IO buffer size specified in loadable code is not enough for transmitting/receiving data
#define GrdE_gcException                            90 // Security violation in Guardant Code virtual environment
#define GrdE_gcRamOverboundInCodeLoad               91 // IO buffer specified in loadable code exceeds the bounds of allowed RAM area
#define GrdE_gcFlashOverboundInCodeLoad             92 // Loadable code exceeds the bounds of allowed FLASH memory area
#define GrdE_gcIntersectionOfCodeAreasInCodeLoad    93 // Allocation of intersecting RAM areas for different loadable code modules ( Init operation is required)
#define GrdE_gcGCEXEFormatError                     94 // Incorrect GCEXE file format
#define GrdE_gcRamAccessViolation                   95 // Incorrect RAM area specified in loadable code for GcaCodeRun
#define GrdE_gcCallDepthOverflow                    96 // Too many nested calls of GcaCodeRun.
#define GrdE_UnableToCreateIniFile                  97 // Unable to create client configuration file
#define GrdE_LastError                              98 // Total number of errors

// Structure returned by GrdFind
#pragma pack(push,1)
typedef struct
{
    DWORD dwPublicCode;             // Public code
    BYTE byHrwVersion;              // Dongle hardware version
    BYTE byMaxNetRes;               // Maximum Guardant Net license limit
    WORD wType;                     // Dongle type flags
    DWORD dwID;                     // Dongle ID (unique)
    // Following fields are available from UAM mode
    BYTE byNProg;                   // Program number
    BYTE byVer;                     // Version
    WORD wSN;                       // Serial number
    WORD wMask;                     // Bit mask
    WORD wGP;                       // Executions GP counter/ License time counter
    WORD wRealNetRes;               // Current Guardant Net license limit, must be <= byMaxNetRes
    DWORD dwIndex;                  // Index for remote programming
    // Only Stealth III info
    BYTE abyReservedISEE[0x1C];     // Reserved for future
    WORD wWriteProtectS3;           // Stealth III write protect address
    WORD wReadProtectS3;            // Stealth III read protect address
    WORD wGlobalFlags;              // Global dongle flags for Sign\Time or higher dongles. See GrdGF_xxx definition.
    DWORD dwDongleState;            // Dongle State. See GrdDSF_XXX definition
    // Available since:
    // 1. Stealth Sign.(Firmware number >= 0x01000011h or 01.00.00.11)
    // 2. Guardant Code.
    DWORD dwOldMPNum;                       // Old firmware number(before SFU).
    BYTE abyReservedD[0x20];
    BYTE abyUid[0x10];                      // MCU unique identifier (Guardant Code since 1.0.2.29)
    BYTE abyReservedH[0x8C];                // Reserved. For align to 0x100
    // Reserved info from gsA
    // Driver info
    DWORD dwGrDrv_Platform;                 // Driver platform (Win32/Win64)
    DWORD dwGrDrv_Vers;                     // Driver version (0x04801234=4.80.12.34
    DWORD dwGrDrv_Build;                    // Driver build
    DWORD dwGrDrv_Flags;                    // Additional flags. 1 - means that is SP dongle in driverless mode
    // dongle info
    DWORD dwRkmUserAddr;                    // wkmUserAddr
    DWORD dwRkmAlgoAddrW;                   // wkmAlgoAddr
    DWORD dwPrnPort;                        // Printer port address or 0 if it USB
    DWORD dwClientVersion;                  // Dongle client version
    // SAP start
    DWORD dwRFlags;                         // Type of MCU
    DWORD dwRProgVer;                       // Program version (in MCU)
    DWORD dwRcn_rc;                         // curr_num & answer code
    DWORD dwNcmps;                          // Number of compare conditions
    DWORD dwNSKClientVersion;               // Client version (low byte - minor, hi - major)
    DWORD dwModel;                          // Dongle Model
    DWORD dwMcuType;                        // Dongle MCU Type
    DWORD dwMemoryType;                     // Dongle Memory Type
    BYTE byFeaturesFlags;                   // Support features (1 - means support)
    // Reserved for future
    BYTE abyReserved[0x200 - 0x100 - 0x29]; // Reserved. For align to 0x200
} TGrdFindInfo;
#pragma pack(pop)

//- Dongle State Flags
#define GrdDSF_CRCError                  1
#define GrdDSF_RemoteUpdateModeOn        2
#define GrdDSF_TimerErrorFrequency       4
#define GrdDSF_TimerErrorIntegrity       8
#define GrdDSF_BatteryError              16

// Dongle memory fields in SAM
#pragma pack(push,1)
typedef struct
{
    // Fields protection against nsc_Init, nsc_Protect, nsc_Write commands
    //    * - Partial protection: nsc_Protect can be executed only after nsc_Init
    //    X - Full protection
    // Protection against command:      Init Protect Write
    BYTE byDongleModel;         //  0h   X     X     X    0=GS,1=GU,2=GF,
    BYTE byDongleMemSize;       //  1h   X     X     X    0=0, 8=256 ( Memsize = 1 << byDongleMemSize )
    BYTE byDongleProgVer;       //  2h   X     X     X
    BYTE byDongleProtocol;      //  3h   X     X     X
    WORD wClientVer;            //  4h   X     X     X    0x104=1.4
    BYTE byDongleUserAddr;      //  6h   X     X     X
    BYTE byDongleAlgoAddr;      //  7h   X     X     X
    WORD wPrnport;              //  8h   X     X     X
    WORD wWriteProtectS3;       //  Ah         *     X      // Stealth III write protect SAM address in bytes
    WORD wReadProtectS3;        //  Ch         *     X      // Stealth III read  protect SAM address in bytes
    DWORD dwPublicCode;         //  Eh   X     X     X
    BYTE byVersion;             // 12h   X     X     X
    BYTE byLANRes;              // 13h   X     X     X
    WORD wType;                 // 14h   X     X     X
    DWORD dwID;                 // 16h   X     X     X
    BYTE byWriteProtect;        // 1Ah         *     X      // Stealth I & II write protect SAM address in words
    BYTE byReadProtect;         // 1Bh         *     X      // Stealth I & II read  protect SAM address in words
    BYTE byNumFunc;             // 1Ch         *     X
    BYTE byTableLMS;            // 1Dh         *     X
    BYTE byNProg;               // 1Eh   X     X
    BYTE byVer;                 // 1Fh   X     X
    WORD wSN;                   // 20h   X     X
    WORD wMask;                 // 22h   X     X
    WORD wGP;                   // 24h   X     X
    WORD wRealLANRes;           // 26h   X     X
    DWORD dwIndex;              // 28h   X     X
    BYTE abyAlgoAddr[1];        // 2Ch
} TGrdStdFields;
#pragma pack(pop)

#pragma pack(push,1)
typedef struct
{
    WORD wYear;             // The year (1601 - 2099)
    WORD wMonth;            // The month (January = 1, February = 2, ...)
    WORD wDayOfWeek;        // The day of the week (Sunday = 0, Monday = 1, ...)
    WORD wDay;              // The day of the month (1-31)
    WORD wHour;             // The hour (0-23)
    WORD wMinute;           // The minute (0-59)
    WORD wSecond;           // The second (0-59)
    WORD wMilliseconds;     // The millisecond (0-999)
} TGrdSystemTime;
#pragma pack(pop)

#define GrdNotifyMessage_DongleArrived     0   // Dongle has been connected to USB port
#define GrdNotifyMessage_DongleRemoved     1   // Dongle has been disconnected from USB port
#define GrdNotifyMessage_ConnectionLost    2   // Lost connection with the Guardant Net Server
